#!/usr/bin/python
# -*- coding: UTF-8 -*-
"""
题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提0.1；利润高于10万元，低于20万元时，低于10万元的部分按0.1提成，高于10万元的部分，可提成0.075；20万到40万之间时，高于20万元的部分，可提成0.05；40万到60万之间时高于40万元的部分，可提成0.03；60万到100万之间时，高于60万元的部分，可提成1.0.05，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？
"""
"""

bonus = 0
profit = raw_input("请输入企业当月利润金额(单位万元)：")
a = float(profit)
if a <= 10:
    bonus = a * 0.1
elif a < 20:
    bonus = 10 * 0.1 + (a - 10)*0.075
elif 20 <= a < 40:
    bonus = 10 * 0.1 + 10 * 0.075 + (a - 20)*0.05
elif 40 <= a < 60:
    bonus = 10 * 0.1 + 10 * 0.075 + 20*0.05 + (a - 40)*0.03
elif 60 <= a < 100:
    bonus = 10 * 0.1 + 10 * 0.075 + 20*0.05 + 20*0.03 +(a - 60)*0.015
else:
    bonus = 10 * 0.1 + 10 * 0.075 + 20*0.05 + 20*0.03 + 40*0.015 +(a - 100)*0.01
print "企业当月利润为%s,应发放奖金总数：%s"%(profit,bonus)

"""
i = int(raw_input('净利润:'))
arr = [1000000,600000,400000,200000,100000,0]
rat = [0.01,0.015,0.03,0.05,0.075,0.1]
r = 0
for idx in range(0,6):
    if i>arr[idx]:
        r+=(i-arr[idx])*rat[idx]
#        print (i-arr[idx])*rat[idx]
        i=arr[idx]
print r